In [3]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [5]:
import mysql.connector

conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="Harish@2006",
    database="demo",
    auth_plugin="mysql_native_password",
    use_pure=True
)

In [7]:
query = "SELECT * FROM ml"
df = pd.read_sql(query, conn)

C:\Users\Hp\AppData\Local\Temp\ipykernel_21552\1719241753.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

In [8]:
df.head()

   SNO      Name  age  height  weight  marks
0    1  Student1   18   160.0    55.0   72.0
1    2  Student2   19   162.0    56.0   74.0
2    3  Student3   20   164.0    57.0   76.0
3    4  Student4   18   165.0    58.0   78.0
4    5  Student5   19   166.0    59.0   80.0